# Challenge Questions - TfL Dataset

# Instructions:
• Please ensure you don't overwrite any existing cells. Add new cells below by pressing ALT+ENTER

• Attempt all of the questions

• You are encouraged to look online for help should you need it

# Dataset overview:
There are three datasets stored in the same directory as this Notebook, they are all related to each other:

• **tfl-daily-cycle-hires.csv**: This dataset contains bike hire data from Transport for London during the period 
30th July 2010 to 30th September 2021. 'Day' is the day in '%d/%m/%Y' format. 'Number of Bicycle Hires' is the total number of bikes hired that day.

#

## Import pandas, numpy and datetime

In [1]:
import pandas as pd

In [2]:
import numpy as np

## Load the files:
• "tfl-daily-cycle-hires.csv" should be assigned to the variable **tfl**

In [9]:
tfl = pd.read_csv('tfl-daily-cycle-hires.csv')

## Check the head of the DataFrame

In [10]:
tfl.head(5)

          Day  Number of Bicycle Hires  Unnamed: 2
0  30/07/2010                   6897.0         NaN
1  31/07/2010                   5564.0         NaN
2  01/08/2010                   4303.0         NaN
3  02/08/2010                   6642.0         NaN
4  03/08/2010                   7966.0         NaN

## Check the data types of the DataFrame columns

In [11]:
tfl.dtypes

Day                         object
Number of Bicycle Hires    float64
Unnamed: 2                 float64
dtype: object

## Change the data types and remove unnecessary columns 

• 'Day' should be a datetime64 data type

• 'Number of Bicycle Hires' should be float64

• Any other columns should be deleted

In [12]:
tfl.columns

Index(['Day', 'Number of Bicycle Hires', 'Unnamed: 2'], dtype='object')

In [13]:
tfl.drop(columns='Unnamed: 2',inplace= True)

In [15]:
tfl.columns

Index(['Day', 'Number of Bicycle Hires'], dtype='object')

In [19]:
tfl['Day'] = tfl['Day'].astype("datetime64")

C:\Users\DELL\AppData\Local\Temp\ipykernel_11648\601412695.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  tfl['Day'] = tfl['Day'].astype("datetime64")

In [20]:
tfl.dtypes

Day                        datetime64[ns]
Number of Bicycle Hires           float64
dtype: object

## What is the average number of bicycle hires per day across the entire dataset?

In [22]:
round(tfl['Number of Bicycle Hires'].mean(),2)

26261.93

## Create a new column called 'Year' which contains the 4 digit year

In [24]:
tfl['Year'] = tfl['Day'].dt.year

In [25]:
tfl['Year']

0       2010
1       2010
2       2010
3       2010
4       2010
        ...
4076    2021
4077    2021
4078    2021
4079    2021
4080    2021
Name: Year, Length: 4081, dtype: int64

## What is the average number of bicycle hires per Year across the entire dataset

In [26]:
tfl.columns

Index(['Day', 'Number of Bicycle Hires', 'Year'], dtype='object')

In [28]:
round(tfl.groupby('Year')['Number of Bicycle Hires'].mean(),2)

Year
2010    14069.76
2011    19568.35
2012    26008.97
2013    22042.35
2014    27462.73
2015    27046.13
2016    28152.01
2017    28619.30
2018    28952.16
2019    28561.52
2020    28508.65
2021    30091.07
Name: Number of Bicycle Hires, dtype: float64

## What is the total number of bicycle hires per Year across the entire dataset

In [29]:
tfl.groupby('Year')['Number of Bicycle Hires'].sum()

Year
2010     2180813.0
2011     7142449.0
2012     9519283.0
2013     8045459.0
2014    10023897.0
2015     9871839.0
2016    10303637.0
2017    10446044.0
2018    10567540.0
2019    10424955.0
2020    10434167.0
2021     8214862.0
Name: Number of Bicycle Hires, dtype: float64

In [30]:
tfl.groupby('Year').sum()

C:\Users\DELL\AppData\Local\Temp\ipykernel_11648\2828621207.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  tfl.groupby('Year').sum()

      Number of Bicycle Hires
Year
2010                2180813.0
2011                7142449.0
2012                9519283.0
2013                8045459.0
2014               10023897.0
2015                9871839.0
2016               10303637.0
2017               10446044.0
2018               10567540.0
2019               10424955.0
2020               10434167.0
2021                8214862.0

In [33]:
tfl[['Year','Number of Bicycle Hires']].groupby('Year').sum()

      Number of Bicycle Hires
Year
2010                2180813.0
2011                7142449.0
2012                9519283.0
2013                8045459.0
2014               10023897.0
2015                9871839.0
2016               10303637.0
2017               10446044.0
2018               10567540.0
2019               10424955.0
2020               10434167.0
2021                8214862.0

## Create a new column called 'Category' on the tfl DataFrame that classifies the number of bike hires per day as:
* 'Low' if the 'Number of Bicycle Hires' is below 10,000
* 'Medium' if the 'Number of Bicycle Hires' is below 40,000 but greater than or equal to 10,000
* 'High' if the 'Number of Bicycle Hires' is greater than or equal to 40,000

In [35]:
tfl['Category'] =  tfl['Number of Bicycle Hires'].apply( lambda x: 'Low' if x<10000 else 'High' if x>=40000 else 'Medium')

In [36]:
tfl

            Day  Number of Bicycle Hires  Year Category
0    2010-07-30                   6897.0  2010      Low
1    2010-07-31                   5564.0  2010      Low
2    2010-01-08                   4303.0  2010      Low
3    2010-02-08                   6642.0  2010      Low
4    2010-03-08                   7966.0  2010      Low
...         ...                      ...   ...      ...
4076 2021-09-26                  45120.0  2021     High
4077 2021-09-27                  32167.0  2021   Medium
4078 2021-09-28                  32539.0  2021   Medium
4079 2021-09-29                  39889.0  2021   Medium
4080 2021-09-30                  34070.0  2021   Medium

[4081 rows x 4 columns]

## For each year in the tfl DataFrame how many days are classed as 'Low', 'Medium' or 'High'?

In [39]:
tfl[['Year','Category','Day']].groupby(by=['Year','Category']).count()

               Day
Year Category
2010 Low        44
     Medium    111
2011 Low        30
     Medium    335
2012 High       27
     Low        19
     Medium    320
2013 Low        25
     Medium    340
2014 High       27
     Low        10
     Medium    328
2015 High       12
     Low         9
     Medium    344
2016 High       37
     Low         6
     Medium    323
2017 High       28
     Low        13
     Medium    324
2018 High       52
     Low        16
     Medium    297
2019 High       20
     Low         3
     Medium    342
2020 High       63
     Low        11
     Medium    292
2021 High       62
     Low         9
     Medium    202